# Challenge 2 - ANOVA

In statistics, **Analysis of Variance (ANOVA)** is also used to analyze the differences among group means. The difference between t-test and ANOVA is the former is ued to compare two groups whereas the latter is used to compare three or more groups. [Read more about the difference between t-test and ANOVA](https://keydifferences.com/difference-between-t-test-and-anova.html).

From the ANOVA test, you receive two numbers. The first number is called the **F-value** which indicates whether your null-hypothesis can be rejected. The critical F-value that rejects the null-hypothesis varies according to the number of total subjects and the number of subject groups in your experiment. In [this table](https://www.itl.nist.gov/div898/handbook/eda/section3/eda3673.htm) you can find the critical values of the F distribution. **If you are confused by the massive F-distribution table, don't worry. Skip F-value for now and study it at a later time. In this challenge you only need to look at the p-value.**

The p-value is another number yielded by ANOVA which already takes the number of total subjects and the number of experiment groups into consideration. **Typically if your p-value is less than 0.05, you can declare the null-hypothesis is rejected.**

In this challenge, we want to understand whether there are significant differences among various types of pokemons' `Total` value, i.e. Grass vs Poison vs Fire vs Dragon... There are many types of pokemons which makes it a perfect use case for ANOVA.

In [1]:
# Import libraries
import pandas as pd
from scipy.stats import f_oneway

In [2]:
# Import dataset

pokemon = pd.read_csv('../../lab-df-calculation-and-transformation/your-code/Pokemon.csv')

pokemon.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

**To achieve our goal, we use three steps:**

1. **Extract the unique values of the pokemon types.**

1. **Select dataframes for each unique pokemon type.**

1. **Conduct ANOVA analysis across the pokemon types.**

#### First let's obtain the unique values of the pokemon types. These values should be extracted from Type 1 and Type 2 aggregated. Assign the unique values to a variable called `unique_types`.

*Hint: the correct number of unique types is 19 including `NaN`. You can disregard `NaN` in next step.*

In [3]:
unique_types_pre = pokemon['Type 1'].unique().tolist()+ pokemon['Type 2'].unique().tolist()
unique_types_1= set(unique_types_pre)
unique_types=list(unique_types_1)
unique_types
# you should see 19

['Fairy',
 nan,
 'Steel',
 'Water',
 'Dragon',
 'Rock',
 'Dark',
 'Poison',
 'Ground',
 'Fire',
 'Ghost',
 'Grass',
 'Fighting',
 'Ice',
 'Normal',
 'Flying',
 'Psychic',
 'Electric',
 'Bug']

#### Second we will create a list named `pokemon_totals` to contain the `Total` values of each unique type of pokemons.

Why we use a list instead of a dictionary to store the pokemon `Total`? It's because ANOVA only tells us whether there is a significant difference of the group means but does not tell which group(s) are significantly different. Therefore, we don't need know which `Total` belongs to which pokemon type.

*Hints:*

* Loop through `unique_types` and append the selected type's `Total` to `pokemon_groups`.
* Skip the `NaN` value in `unique_types`. `NaN` is a `float` variable which you can find out by using `type()`. The valid pokemon type values are all of the `str` type.
* At the end, the length of your `pokemon_totals` should be 18.

In [66]:
pokemon_totals = []
for i in unique_types:
    if type(i)!=float:
        pokemon_totals.append(pokemon[(pokemon['Type 2']==i)]['Total'])or(pokemon[(pokemon['Type 1']==i)]['Total'])

len(pokemon_totals) # you should see 18

18

In [67]:
pokemon_totals

[44     270
 45     435
 131    460
 188    210
 198    250
 199    420
 303    198
 304    278
 305    518
 306    618
 322    190
 328    380
 329    480
 366    590
 487    310
 591    545
 606    280
 607    480
 772    431
 773    500
 777    470
 795    600
 796    700
 Name: Total, dtype: int64, 88     325
 89     465
 220    465
 228    500
 229    600
 440    530
 455    350
 456    495
 460    424
 497    525
 498    625
 513    535
 528    525
 542    600
 589    508
 650    495
 658    305
 659    489
 685    340
 686    490
 693    484
 717    600
 Name: Total, dtype: int64, 149    355
 150    495
 151    355
 152    495
 307    269
 398    290
 399    410
 400    530
 445    410
 533    520
 758    306
 759    500
 760    320
 799    600
 Name: Total, dtype: int64, 7      634
 196    610
 249    540
 275    630
 360    340
 361    520
 540    680
 541    680
 544    680
 545    680
 694    300
 695    420
 696    600
 761    494
 766    362
 767    521
 790    245
 791    535
 Name: Total, dtype: int64, 119    345
 120    485
 230    505
 237    410
 240    380
 330    330
 331    430
 332    530
 404    485
 515    535
 618    325
 619    475
 625    355
 626    495
 Name: Total, dtype: int64, 141    640
 267    600
 268    700
 297    340
 298    480
 347    305
 348    460
 349    560
 363    475
 374    468
 482    329
 483    479
 490    485
 502    500
 611    292
 612    351
 613    519
 726    530
 743    495
 798    680
 Name: Total, dtype: int64, 0      318
 1      405
 2      525
 3      625
 16     195
 17     205
 18     395
 19     495
 48     320
 49     395
 50     490
 53     305
 54     450
 75     300
 76     390
 77     490
 78     335
 79     515
 99     310
 100    405
 101    500
 102    600
 181    250
 182    390
 227    430
 292    385
 344    400
 451    280
 452    515
 603    260
 604    360
 605    485
 651    294
 652    464
 Name: Total, dtype: int64, 36     505
 39     505
 80     300
 81     390
 82     495
 103    385
 209    210
 210    430
 223    510
 224    610
 238    250
 239    450
 265    300
 266    410
 281    405
 282    535
 283    635
 314    266
 352    305
 353    460
 354    560
 371    288
 372    468
 434    525
 459    424
 470    475
 491    300
 492    410
 493    600
 494    700
 524    530
 596    384
 597    509
 728    423
 794    600
 Name: Total, dtype: int64, 246    330
 247    500
 248    600
 424    770
 532    520
 553    600
 668    275
 669    370
 670    520
 697    360
 698    550
 706    680
 Name: Total, dtype: int64, 316    236
 326    380
 327    480
 530    480
 531    440
 653    335
 654    480
 683    303
 684    483
 748    325
 749    448
 750    520
 751    520
 797    600
 Name: Total, dtype: int64, 51     285
 52     405
 271    600
 293    220
 294    340
 295    480
 377    355
 378    495
 458    424
 536    520
 600    310
 601    380
 602    500
 646    335
 647    475
 778    309
 779    474
 780    335
 781    335
 782    335
 783    335
 784    494
 785    494
 786    494
 787    494
 Name: Total, dtype: int64, 67     510
 163    780
 231    500
 232    600
 277    405
 278    530
 279    630
 310    460
 436    405
 437    534
 476    580
 503    300
 504    490
 526    518
 527    618
 558    418
 559    528
 620    348
 621    488
 699    580
 700    580
 701    580
 713    580
 714    580
 716    600
 720    530
 Name: Total, dtype: int64, 94     475
 98     525
 142    535
 233    430
 509    334
 510    494
 511    594
 512    510
 534    520
 710    660
 711    700
 712    700
 768    362
 769    521
 Name: Total, dtype: int64, 735    369
 736    507
 764    289
 765    481
 Name: Total, dtype: int64, 6      534
 8      634
 15     395
 20     251
 21     349
 22     479
 23     579
 26     262
 27     442
 46     245
 47     455
 90     352
 91     310
 92     460
 132    500
 137    600
 140    540
 153    515
 154    615
 156    580
 157    580
 158    580
 161    600
 177    262
 178    442
 179    265
 180    390
 183    535
 190    405
 191    320
       ...
 519    545
 520    515
 523    510
 535    520
 551    600
 578    264
 579    358
 580    488
 586    313
 587    425
 622    490
 627    401
 628    567
 641    305
 642    473
 648    428
 688    350
 689    510
 690    370
 691    510
 704    580
 705    580
 708    600
 709    600
 729    278
 730    382
 731    499
 734    411
 771    500
 793    680
 Name: Total, Length: 97, dtype: int64, 85     315
 86     490
 87     590
 110    325
 111    520
 130    520
 133    455
 214    490
 218    455
 257    305
 334    280
 335    410
 336    510
 369    440
 370    440
 375    300
 376    500
 410    300
 411    420
 412    600
 413    700
 417    600
 418    700
 419    600
 420    700
 427    600
 484    300
 485    500
 616    540
 715    600
 723    534
 756    288
 757    482
 Name: Total, dtype: int64, 184    330
 185    460
 656    319
 657    472
 679    471
 707    680
 Name: Total, dtype: int64, 379    355
 380    495
 501    330
 Name: Total, dtype: int64]

#### Now we run ANOVA test on `pokemon_totals`.

*Hints:*

* To conduct ANOVA, you can use `scipy.stats.f_oneway()`. Here's the [reference](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.f_oneway.html).

* What if `f_oneway` throws an error because it does not accept `pokemon_totals` as a list? The trick is to add a `*` in front of `pokemon_totals`, e.g. `stats.f_oneway(*pokemon_groups)`. This trick breaks the list and supplies each list item as a parameter for `f_oneway`.

In [68]:
# Your code here
f_oneway(*pokemon_totals)

F_onewayResult(statistic=2.7463260975846784, pvalue=0.00024695147909881604)

#### Interpret the ANOVA test result. Is the difference significant?

In [ ]:
# Your comment here